Repository: fullstackhero/dotnet-starter-kit
Catalog: src/Host/Localization/*/Application-*.po
Languages: de, fr, it, nl, pt

# FSH.WebApi.Application.Catalog.Brands.CreateBrandRequestValidator
source: Brand {0} already Exists.
de: Marke {0} existiert bereits.
fr: La marque {0} existe déjà.
it: Marca {0} esiste già.
nl: Merk {0} bestaat al.
pt: A Marca {0} já existe.

# FSH.WebApi.Application.Catalog.Brands.DeleteBrandRequestHandler
source: Brand cannot be deleted as it's being used.
de: Die Marke kann nicht gelöscht werden, da sie verwendet wird.
fr: La marque ne peut pas être supprimée car elle est utilisée.
it: Il marchio non può essere eliminato in quanto è in uso.
nl: Merk kan niet worden verwijderd omdat het wordt gebruikt.
pt: Marca não pode ser excluída, pois está sendo usada.

# FSH.WebApi.Application.Catalog.Brands.DeleteBrandRequestHandler
source: Brand {0} Not Found.
de: Marke {0} nicht gefunden.
fr: Marque {0} introuvable.
it: Marca {0} non trovata.
nl: Merk {0} niet gevonden.
pt: Marca {0} não encontrada.

# FSH.WebApi.Application.Catalog.Brands.GetBrandRequestHandler
source: Brand {0} Not Found.
de: Marke {0} nicht gefunden.
fr: Marque {0} introuvable.
it: Marca {0} non trovata.
nl: Merk {0} niet gevonden.
pt: Marca {0} não encontrada.

# FSH.WebApi.Application.Catalog.Brands.UpdateBrandRequestValidator
source: Brand {0} already Exists.
de: Marke {0} existiert bereits.
fr: La marque {0} existe déjà.
it: Marca {0} esiste già.
nl: Merk {0} bestaat al.
pt: A Marca {0} já existe.

# FSH.WebApi.Application.Catalog.Brands.UpdateBrandRequestHandler
source: Brand {0} Not Found.
de: Marke {0} nicht gefunden.
fr: Marque {0} introuvable.
it: Marca {0} non trovata.
nl: Merk {0} niet gevonden.
pt: Marca {0} não encontrada.

# FSH.WebApi.Application.Catalog.Products.CreateProductRequestValidator
source: Product {0} already Exists.
de: Produkt {0} existiert bereits.
fr: Le produit {0} existe déjà.
it: Prodotto {0} esiste già.
nl: Product {0} bestaat al.
pt: O produto {0} já existe.

# FSH.WebApi.Application.Catalog.Products.CreateProductRequestValidator
source: Brand {0} Not Found.
de: Marke {0} nicht gefunden.
fr: Marque {0} introuvable.
it: Marca {0} non trovata.
nl: Merk {0} niet gevonden.
pt: Marca {0} não encontrada.

# FSH.WebApi.Application.Catalog.Products.DeleteProductRequestHandler
source: Product {0} Not Found.
de: Produkt {0} nicht gefunden.
fr: Produit {0} introuvable.
it: Prodotto {0} non trovato.
nl: Product {0} niet gevonden.
pt: Produto {0} não encontrado.

# FSH.WebApi.Application.Catalog.Products.GetProductRequestHandler
source: Product {0} Not Found.
de: Produkt {0} nicht gefunden.
fr: Produit {0} introuvable.
it: Prodotto {0} non trovato.
nl: Product {0} niet gevonden.
pt: Produto {0} não encontrado.

# FSH.WebApi.Application.Catalog.Products.GetProductViaDapperRequestHandler
source: Product {0} Not Found.
de: Produkt {0} nicht gefunden.
fr: Produit {0} introuvable.
it: Prodotto {0} non trovato.
nl: Product {0} niet gevonden.
pt: Produto {0} não encontrado.

# FSH.WebApi.Application.Catalog.Products.UpdateProductRequestHandler
source: Product {0} Not Found.
de: Produkt {0} nicht gefunden.
fr: Produit {0} introuvable.
it: Prodotto {0} non trovato.
nl: Product {0} niet gevonden.
pt: Produto {0} não encontrado.

# FSH.WebApi.Application.Catalog.Products.UpdateProductRequestValidator
source: Product {0} already Exists.
de: Produkt {0} existiert bereits.
fr: Le produit {0} existe déjà.
it: Prodotto {0} esiste già.
nl: Product {0} bestaat al.
pt: O produto {0} já existe.

# FSH.WebApi.Application.Catalog.Products.UpdateProductRequestValidator
source: Brand {0} Not Found.
de: Marke {0} nicht gefunden.
fr: Marque {0} introuvable.
it: Marca {0} non trovata.
nl: Merk {0} niet gevonden.
pt: Marca {0} não encontrada.

# FSH.WebApi.Application.Common.FileStorage.FileUploadRequestValidator
source: Image Name cannot be empty!
de: Bildname darf nicht leer sein!
fr: Le nom de l'image ne peut pas être vide!
it: Il nome dell'immagine non può essere vuoto!
nl: Afbeeldingsnaam mag niet leeg zijn!
pt: O nome da imagem não pode estar vazio!

# FSH.WebApi.Application.Common.FileStorage.FileUploadRequestValidator
source: Image Extension cannot be empty!
de: Bild-Erweiterung darf nicht leer sein!
fr: L'extension de l'image ne peut pas être vide!
it: L'estensione dell'immagine non può essere vuota!
nl: Afbeelding extensie mag niet leeg zijn!
pt: A extensão da imagem não pode estar vazia!

# FSH.WebApi.Application.Common.FileStorage.FileUploadRequestValidator
source: Image Data cannot be empty!
de: Bilddaten dürfen nicht leer sein!
fr: Les données de l'image ne peuvent pas être vides!
it: I dati immagine non possono essere vuoti!
nl: Afbeeldingsgegevens mogen niet leeg zijn!
pt: Dados da imagem não podem estar vazios!

# FSH.WebApi.Application.Dashboard.GetStatsRequestHandler
source: Products
de: Produkte
fr: Produits
it: Prodotti
nl: Product(en)
pt: produtos

# FSH.WebApi.Application.Dashboard.GetStatsRequestHandler
source: Brands
de: Marken
fr: Marques
it: Marchi
nl: Merken
pt: Marcas

# FSH.WebApi.Application.Identity.Roles.CreateOrUpdateRoleRequestValidator
source: Similar Role already exists.
de: Ähnliche Rolle existiert bereits.
fr: Un rôle similaire existe déjà.
it: Ruolo simile esiste già.
nl: Vergelijkbare rol bestaat al.
pt: Função similar já existe.

# FSH.WebApi.Application.Identity.Tokens.TokenRequestValidator
source: Invalid Email Address.
de: Ungültige E-Mail-Adresse.
fr: Adresse e-mail invalide.
it: Indirizzo Email Non Valido.
nl: Ongeldig e-mailadres.
pt: E-mail inválido

# FSH.WebApi.Application.Identity.Users.CreateUserRequestValidator
source: Invalid Email Address.
de: Ungültige E-Mail-Adresse.
fr: Adresse e-mail invalide.
it: Indirizzo Email Non Valido.
nl: Ongeldig e-mailadres.
pt: E-mail inválido

# FSH.WebApi.Application.Identity.Users.CreateUserRequestValidator
source: Email {0} is already registered.
de: E-Mail {0} ist bereits registriert.
fr: L'e-mail {0} est déjà enregistré.
it: L'email {0} è già registrata.
nl: E-mail {0} is al geregistreerd.
pt: E-mail {0} já está registrado.

# FSH.WebApi.Application.Identity.Users.CreateUserRequestValidator
source: Username {0} is already taken.
de: Benutzername {0} ist bereits vergeben.
fr: Le nom d'utilisateur {0} est déjà pris.
it: Il nome utente {0} è già stato preso.
nl: Gebruikersnaam {0} is al in gebruik.
pt: Nome de usuário {0} já está em uso.

# FSH.WebApi.Application.Identity.Users.CreateUserRequestValidator
source: Phone number {0} is already registered.
de: Telefonnummer {0} ist bereits registriert.
fr: Le numéro de téléphone {0} est déjà enregistré.
it: Il numero di telefono {0} è già registrato.
nl: Telefoonnummer {0} is al geregistreerd.
pt: Número de telefone {0} já está registrado.

# FSH.WebApi.Application.Identity.Users.Password.ChangePasswordRequestValidator
source: Passwords do not match.
de: Passwörter stimmen nicht überein.
fr: Les mots de passe ne correspondent pas.
it: Le password non corrispondono.
nl: Wachtwoorden komen niet overeen.
pt: As senhas não conferem.

# FSH.WebApi.Application.Identity.Users.Password.ForgotPasswordRequestValidator
source: Invalid Email Address.
de: Ungültige E-Mail-Adresse.
fr: Adresse e-mail invalide.
it: Indirizzo Email Non Valido.
nl: Ongeldig e-mailadres.
pt: E-mail inválido

# FSH.WebApi.Application.Identity.Users.UpdateUserRequestValidator
source: Invalid Email Address.
de: Ungültige E-Mail-Adresse.
fr: Adresse e-mail invalide.
it: Indirizzo Email Non Valido.
nl: Ongeldig e-mailadres.
pt: E-mail inválido

# FSH.WebApi.Application.Identity.Users.UpdateUserRequestValidator
source: Email {0} is already registered.
de: E-Mail {0} ist bereits registriert.
fr: L'e-mail {0} est déjà enregistré.
it: L'email {0} è già registrata.
nl: E-mail {0} is al geregistreerd.
pt: E-mail {0} já está registrado.

# FSH.WebApi.Application.Identity.Users.UpdateUserRequestValidator
source: Phone number {0} is already registered.
de: Telefonnummer {0} ist bereits registriert.
fr: Le numéro de téléphone {0} est déjà enregistré.
it: Il numero di telefono {0} è già registrato.
nl: Telefoonnummer {0} is al geregistreerd.
pt: Número de telefone {0} já está registrado.

# FSH.WebApi.Application.Multitenancy.CreateTenantRequestValidator
source: Tenant {0} already exists.
de: Instanz {0} existiert bereits.
fr: Le locataire {0} existe déjà.
it: Inquilino {0} esiste già.
nl: Tenant {0} bestaat al.
pt: Inquilino {0} já existe.

# FSH.WebApi.Application.Multitenancy.CreateTenantRequestValidator
source: Connection string invalid.
de: Verbindungszeichenkette ungültig.
fr: Chaîne de connexion invalide.
it: Stringa di connessione non valida.
nl: Verbindingreeks ongeldig.
pt: String de conexão inválida.
