Repository: fullstackhero/dotnet-starter-kit
Catalog: src/Host/Localization/*/Infrastructure-*.po
Languages: de, fr, it, nl, pt

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Role Not Found
de: Rolle nicht gefunden
fr: Rôle introuvable
it: Ruolo Non Trovato
nl: Rol niet gevonden
pt: Papel não encontrado

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Register role failed
de: Rollenregistrierung fehlgeschlagen
fr: Échec de l'enregistrement du rôle
it: Registro ruolo fallito
nl: Registratie rol mislukt
pt: Falha ao registrar papel

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Role {0} Created.
de: Rolle {0} erstellt.
fr: Rôle {0} créé.
it: Ruolo {0} Creato.
nl: Rol {0} aangemaakt.
pt: Papel {0} Criado.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Not allowed to modify {0} Role.
de: {0} Rolle kann nicht geändert werden.
fr: Non autorisé à modifier le rôle {0}.
it: Non è consentito modificare {0} ruolo.
nl: Het is niet toegestaan om {0} rol te wijzigen.
pt: Sem permissão para modificar papel {0}.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Update role failed
de: Update-Rolle fehlgeschlagen
fr: Échec de la mise à jour du rôle
it: Aggiornamento ruolo fallito
nl: Bijwerken rol mislukt
pt: Falha ao atualizar papel

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Role {0} Updated.
de: Rolle {0} aktualisiert.
fr: Rôle {0} mis à jour.
it: Ruolo {0} aggiornato.
nl: Rol {0} bijgewerkt.
pt: Função {0} atualizada.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Not allowed to modify Permissions for this Role.
de: Nicht erlaubt, Berechtigungen für diese Rolle zu ändern.
fr: Non autorisé à modifier les permissions pour ce rôle.
it: Non è consentito modificare i permessi per questo ruolo.
nl: Het is niet toegestaan om machtigingen aan te passen voor deze rol.
pt: Não é permitido modificar Permissões para este Papel.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Update permissions failed.
de: Update-Berechtigungen fehlgeschlagen.
fr: Les autorisations de mise à jour ont échoué.
it: Autorizzazioni di aggiornamento non riuscite.
nl: Update rechten mislukt.
pt: Permissões da atualização falharam.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Permissions Updated.
de: Berechtigungen aktualisiert.
fr: Permissions mises à jour.
it: Autorizzazioni Aggiornate.
nl: Machtigingen bijgewerkt.
pt: Permissões atualizadas.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Not allowed to delete {0} Role.
de: {0} Rolle kann nicht gelöscht werden.
fr: Non autorisé à supprimer le rôle {0}.
it: Non è consentito eliminare {0} ruolo.
nl: Niet toegestaan om {0} rol te verwijderen.
pt: Não tem permissão para excluir papel {0}.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Not allowed to delete {0} Role as it is being used.
de: {0} Rolle kann nicht gelöscht werden, da sie verwendet wird.
fr: Non autorisé à supprimer le rôle {0} car il est utilisé.
it: Non è consentito eliminare {0} ruolo come viene utilizzato.
nl: Niet toegestaan om {0} rol te verwijderen terwijl deze in gebruik is.
pt: Não é permitido excluir a função {0} como ela está sendo usada.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Role {0} Deleted.
de: Rolle {0} gelöscht.
fr: Rôle {0} supprimé.
it: Ruolo {0} Eliminato.
nl: Rol {0} verwijderd.
pt: Papel {0} excluído.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: Authentication Failed.
de: Authentifizierung fehlgeschlagen.
fr: Échec de l'authentification.
it: Autenticazione Fallita.
nl: Authenticatie mislukt.
pt: Falha na autenticação.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: User Not Active. Please contact the administrator.
de: Benutzer nicht aktiv. Bitte kontaktieren Sie den Administrator.
fr: Utilisateur non actif. Veuillez contacter l'administrateur.
it: Utente non attivo. Si prega di contattare l'amministratore.
nl: Gebruiker niet actief. Neem contact op met de beheerder.
pt: Usuário Inativo. Por favor, contate o administrador.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: E-Mail not confirmed.
de: E-Mail nicht bestätigt.
fr: E-Mail non confirmé.
it: E-mail non confermata.
nl: E-mailadres niet bevestigd.
pt: E-mail não confirmado.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: Tenant is not Active. Please contact the Application Administrator.
de: Die Instanz ist nicht aktiv. Bitte wenden Sie sich an den Anwendungsadministrator.
fr: Le locataire n'est pas actif. Veuillez contacter l'administrateur de l'application.
it: Tenant non è attivo. Si prega di contattare l'amministratore dell'applicazione.
nl: Tenant is niet actief. Neem contact op met de applicatiebeheerder.
pt: O inquilino não está ativo. Entre em contato com o administrador do aplicativo.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: Tenant Validity Has Expired. Please contact the Application Administrator.
de: Die Mandantengültigkeit ist abgelaufen. Bitte wenden Sie sich an den Anwendungsadministrator.
fr: La validité du locataire a expiré. Veuillez contacter l'administrateur de l'application.
it: La Validità del Tenant è scaduta. Si prega di contattare l'amministratore dell'applicazione.
nl: Tenant validiteit is verlopen. Neem contact op met de applicatiebeheerder.
pt: A validade do inquilino expirou. Entre em contato com o administrador do aplicativo.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: Invalid Refresh Token.
de: Ungültiges Aktualisierungs-Token.
fr: Jeton de rafraîchissement invalide.
it: Token Di Aggiornamento Non Valido.
nl: Ongeldige vernieuw Token.
pt: Token de atualização inválido.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: Invalid Token.
de: Ungültiges Token.
fr: Jeton invalide.
it: Token Non Valido.
nl: Ongeldige Token.
pt: Token inválido.

# FSH.WebApi.Infrastructure.Identity.UserService
source: An error occurred while confirming E-Mail.
de: Beim Bestätigen der E-Mail ist ein Fehler aufgetreten.
fr: Une erreur s'est produite lors de la confirmation de l'e-mail.
it: Si è verificato un errore durante la conferma di E-Mail.
nl: Er is een fout opgetreden tijdens het bevestigen van e-mailadres.
pt: Ocorreu um erro ao confirmar o e-mail.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Account Confirmed for E-Mail {0}. You can now use the /api/tokens endpoint to generate JWT.
de: Konto für E-Mail {0}bestätigt. Sie können nun den /api/tokens Endpunkt verwenden, um JWT zu generieren.
fr: Compte Confirmé pour l'E-Mail {0}. Vous pouvez maintenant utiliser le point de terminaison /api/tokens pour générer JWT.
it: Account confermato per e-mail {0}. È ora possibile utilizzare l'endpoint /api/tokens per generare JWT.
nl: Account bevestigd voor E-Mail {0}. U kunt nu het eindpunt /api/tokens gebruiken om JWT. te genereren.
pt: Conta Confirmada para E-Mail {0}. Agora você pode usar o endpoint /api/tokens para gerar JWT.

# FSH.WebApi.Infrastructure.Identity.UserService
source: An error occurred while confirming {0}
de: Beim Bestätigen von {0} ist ein Fehler aufgetreten
fr: Une erreur est survenue lors de la confirmation de {0}
it: Si è verificato un errore durante la conferma {0}
nl: Er is een fout opgetreden tijdens het bevestigen van {0}
pt: Ocorreu um erro ao confirmar {0}

# FSH.WebApi.Infrastructure.Identity.UserService
source: An error occurred while confirming Mobile Phone.
de: Beim Bestätigen des Mobiltelefons ist ein Fehler aufgetreten.
fr: Une erreur s'est produite lors de la confirmation du téléphone mobile.
it: Si è verificato un errore durante la conferma del cellulare
nl: Er is een fout opgetreden tijdens het bevestigen van mobiele telefoon.
pt: Ocorreu um erro ao confirmar o Celular.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Account Confirmed for Phone Number {0}. You can now use the /api/tokens endpoint to generate JWT.
de: Konto für Telefonnummer {0}bestätigt. Sie können nun den /api/tokens Endpunkt verwenden, um JWT zu generieren.
fr: Compte confirmé pour le numéro de téléphone {0}. Vous pouvez maintenant utiliser le point de terminaison /api/tokens pour générer du JWT.
it: Account confermato per il numero di telefono {0}. È ora possibile utilizzare l'endpoint /api/tokens per generare JWT.
nl: Account bevestigd voor telefoon nummer {0}. U kunt nu het eindpunt /api/tokens gebruiken om JWT. te genereren.
pt: Conta confirmada para o número de telefone {0}. Agora você pode usar o endpoint /api/tokens para gerar JWT.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Account Confirmed for Phone Number {0}. You should confirm your E-mail before using the /api/tokens endpoint to generate JWT.
de: Konto für Telefonnummer {0}bestätigt. Sie sollten Ihre E-Mail bestätigen, bevor Sie den /api/tokens Endpunkt verwenden, um JWT zu generieren.
fr: Compte Confirmé pour le numéro de téléphone {0}. Vous devriez confirmer votre adresse e-mail avant d'utiliser le point de terminaison /api/tokens pour générer du JWT.
it: Account confermato per il numero di telefono {0}. È necessario confermare la propria e-mail prima di utilizzare l'endpoint /api/tokens per generare JWT.
nl: Account bevestigd voor telefoonnummer {0}. Bevestig uw e-mail voordat u het eindpunt /api/tokens gebruikt om JWT. te genereren.
pt: Conta confirmada pelo Número de Telefone {0}. Você deve confirmar o seu e-mail antes de usar o endpoint /api/tokens para gerar JWT.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Username or Email not valid.
de: Benutzername oder E-Mail ungültig.
fr: Le nom d'utilisateur ou l'adresse e-mail n'est pas valide.
it: Nome utente o Email non valido.
nl: Gebruikersnaam of e-mailadres niet geldig.
pt: Nome de usuário ou e-mail inválido.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Username {0} is already taken.
de: Benutzername {0} ist bereits vergeben.
fr: Le nom d'utilisateur {0} est déjà pris.
it: Il nome utente {0} è già stato preso.
nl: Gebruikersnaam {0} is al in gebruik.
pt: Nome de usuário {0} já está em uso.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Email {0} is already taken.
de: E-Mail {0} ist bereits vergeben.
fr: L'e-mail {0} est déjà utilisé.
it: L'email {0} è già stata presa.
nl: E-mail {0} is al in gebruik.
pt: E-mail {0} já está sendo usado.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Validation Errors Occurred.
de: Validierungsfehler aufgetreten.
fr: Des erreurs de validation sont survenues.
it: Errori Di Convalida Si Sono verificati.
nl: Er zijn fouten opgetreden.
pt: Ocorreu erros de validação.

# FSH.WebApi.Infrastructure.Identity.UserService
source: User {0} Registered.
de: Benutzer {0} registriert.
fr: Utilisateur {0} enregistré.
it: Utente {0} Registrato.
nl: Gebruiker {0} geregistreerd.
pt: Usuário {0} Registrado.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Confirm Registration
de: Registrierung bestätigen
fr: Confirmer l'inscription
it: Conferma Registrazione
nl: Registratie bevestigen
pt: Confirmar registro

# FSH.WebApi.Infrastructure.Identity.UserService
source: User Not Found.
de: Benutzer nicht gefunden.
fr: Utilisateur introuvable.
it: Utente Non Trovato.
nl: Gebruiker niet gevonden.
pt: Usuário não encontrado.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Update profile failed
de: Update-Profil fehlgeschlagen
fr: La mise à jour du profil a échoué
it: Aggiornamento profilo fallito
nl: Update profiel is mislukt
pt: Falha ao atualizar perfil

# FSH.WebApi.Infrastructure.Identity.UserService
source: Invalid Tenant.
de: Ungültiger Mandant.
fr: Tenant invalide.
it: Tenant Non Valido.
nl: Ongeldige instantie.
pt: Inquilino inválido.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Administrators Profile's Status cannot be toggled
de: Status des Administratorenprofils kann nicht umgeschaltet werden
fr: Le statut du profil des administrateurs ne peut pas être basculé
it: Impossibile modificare lo stato del profilo degli amministratori
nl: De status van het beheerdersprofiel kan niet worden omgeschakeld
pt: O status do Perfil dos Administradores não pode ser alternado

# FSH.WebApi.Infrastructure.Identity.UserService
source: An Error has occurred!
de: Ein Fehler ist aufgetreten!
fr: Une erreur est survenue !
it: Si è verificato un errore!
nl: Er is een fout opgetreden!
pt: Ocorreu um erro!

# FSH.WebApi.Infrastructure.Identity.UserService
source: Reset Password
de: Passwort zurücksetzen
fr: Réinitialiser le mot de passe
it: Reimposta Password
nl: Wachtwoord opnieuw instellen
pt: Redefinir a senha

# FSH.WebApi.Infrastructure.Identity.UserService
source: Password Reset Mail has been sent to your authorized Email.
de: E-Mail zum Zurücksetzen des Passworts wurde an Ihre autorisierte E-Mail gesendet.
fr: Le courriel de réinitialisation de mot de passe a été envoyé à votre adresse électronique autorisée.
it: Password Reset Mail è stata inviata alla tua email autorizzata.
nl: E-mail om het wachtwoord te resetten is verzonden naar uw geautoriseerde e-mailadres.
pt: E-mail de redefinição de senha foi enviado para seu e-mail autorizado.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Password Reset Successful!
de: Passwort erfolgreich zurückgesetzt!
fr: Mot de passe réinitialisé avec succès !
it: Reset Password Con Successo!
nl: Wachtwoord resetten geslaagd!
pt: Senha redefinida com sucesso!

# FSH.WebApi.Infrastructure.Identity.UserService
source: Change password failed
de: Passwort ändern fehlgeschlagen
fr: La modification du mot de passe a échoué
it: Modifica password fallita
nl: Wachtwoord wijzigen mislukt
pt: Falha ao alterar senha

# FSH.WebApi.Infrastructure.Identity.UserService
source: Cannot Remove Admin Role From Root Tenant Admin.
de: Admin-Rolle kann nicht vom Root-Tenant-Admin entfernt werden.
fr: Impossible de supprimer le rôle administrateur de l'administrateur de l'administrateur du locataire racine.
it: Impossibile Rimuovere Il Ruolo Dell'Amministratore Dal Root Tenant Admin.
nl: Kan de beheerdersrol niet verwijderen uit de Root Tenant Admin.
pt: Não é possível remover função de administrador do tenant admin.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Tenant should have at least 2 Admins.
de: Der Mandant sollte mindestens 2 Administratoren haben.
fr: Le locataire doit avoir au moins 2 Admins.
it: L'inquilino dovrebbe avere almeno 2 amministratori.
nl: Tenant moet ten minste 2 beheerders hebben.
pt: O inquilino deve ter no mínimo 2 Administradores.

# FSH.WebApi.Infrastructure.Identity.UserService
source: User Roles Updated Successfully.
de: Benutzerrollen erfolgreich aktualisiert.
fr: Rôles utilisateur mis à jour avec succès.
it: Ruoli Utente Aggiornati Con Successo.
nl: Gebruikersrollen succesvol bijgewerkt.
pt: Cargos do Usuário atualizados com sucesso.

# FSH.WebApi.Infrastructure.Middleware.ExceptionMiddleware
source: Provide the ErrorId {0} to the support team for further analysis.
de: Geben Sie dem Support-Team die ErrorId {0} zur weiteren Analyse an.
fr: Fournir l'ErrorId {0} à l'équipe de support pour une analyse plus approfondie.
it: Fornire l'ErrorId {0} al team di supporto per ulteriori analisi.
nl: Geef de Fout-ID {0} aan het supportteam voor verdere analyse.
pt: Forneça o ErrorId {0} à equipe de suporte para uma análise mais aprofundada.

# FSH.WebApi.Infrastructure.Multitenancy.TenantService
source: Tenant is already Activated.
de: Mandant ist bereits aktiviert.
fr: Locataire est déjà activé.
it: Inquilino è già attivato.
nl: De tenant is al geactiveerd.
pt: Inquilino já está ativado.

# FSH.WebApi.Infrastructure.Multitenancy.TenantService
source: Tenant {0} is now Activated.
de: Instanz {0} ist jetzt aktiviert.
fr: Le locataire {0} est maintenant activé.
it: Il Tenant {0} è ora attivato.
nl: Tenant {0} is nu geactiveerd.
pt: Inquilino {0} foi ativado agora.

# FSH.WebApi.Infrastructure.Multitenancy.TenantService
source: Tenant is already Deactivated.
de: Mandant ist bereits deaktiviert.
fr: Le tenant est déjà désactivé.
it: Il Tenant è già disattivato.
nl: De instantie is al gedeactiveerd.
pt: O inquilino já está desativado.

# FSH.WebApi.Infrastructure.Multitenancy.TenantService
source: {0} {1} Not Found.
de: {0} {1} nicht gefunden.
fr: {0} {1} introuvable.
it: {0} {1} non trovato.
nl: {0} {1} niet gevonden.
pt: {0} {1} não encontrado.
